a = [33 34 35 36 31 35 35 32 33 36 35 37 28 35 34 30 34 35 33 34 37 36 28 30];
b = [4 1 -6 -4 -4 -4 -2 3 4 0 -7 -10 0 -1 8 1 4 6 2 4 4 5 18 6];
v = [31.5 30.1 29.9 29.3 29.1 29.1 28.9 28.3 28.8 29.2 28.9 28.3 26.7 25.1 24.9 25.8 24.9 24.9 24.9 23.8 23.4 24.1 24.6 24.4];

x = ((v.^2 .* sin(2*(a+b)))./19.6) + sqrt((v.^2 .* sin(2*(a+b)))./19.6) .* ((v.^2 .* sin(2*(a+b)))./19.6) + ((2*v.^2.*(cosd(a+b)).*(cosd(a+b)))./9.8);

plot3(a, b, v, 'o', 'MarkerSize', 5, 'MarkerFaceColor', 'b')
hold on
grid on
xlabel('出手角a')
ylabel('初始攻角b')
zlabel('出手速度v')
title('投掷距离与出手角、初始攻角和出手速度的关系')
